# Usage:
#   brew bundle --file=~/path/to/Brewfile        # Install all
#   brew bundle check --file=~/path/to/Brewfile   # Check if satisfied
#   brew bundle cleanup --file=~/path/to/Brewfile # List not in Brewfile
#   brew bundle dump --force --file=Brewfile       # Regenerate from current

# Taps
tap "channprj/tap" # for kmsg
tap "FelixKratz/formulae" # for jankyborders
tap "nikitabobko/tap" # for aerospace
tap "steipete/tap" # for codexbar

# Brews
brew "apktool"
brew "asitop"
brew "bash"
brew "borders"
brew "cadaver"
brew "cmake"
brew "container"
brew "go"
brew "hf"
brew "imagemagick"
brew "kmsg"
brew "mole"
brew "pnpm"
brew "shellcheck"

# Casks
cask "aerospace"
cask "alfred"
cask "bitwarden"
cask "brave-browser"
cask "calibre"
cask "choosy"
cask "claude"
cask "codex"
cask "codexbar"
cask "container"
cask "font-comic-mono"
cask "font-d2coding"
cask "ghostty"
cask "heynote"
cask "hop"
cask "input-source-pro"
cask "itsycal"
cask "thaw" # ice replacement
cask "karabiner-elements"
cask "scroll-reverser"
cask "stats"
cask "ticktick"
cask "zoom"
