# Usage:
#   brew bundle --file=~/path/to/Brewfile        # Install all
#   brew bundle check --file=~/path/to/Brewfile   # Check if satisfied
#   brew bundle cleanup --file=~/path/to/Brewfile # List not in Brewfile
#   brew bundle dump --force --file=Brewfile       # Regenerate from current

# Taps
tap "FelixKratz/formulae" # for jankyborders
tap "nikitabobko/tap" # for aerospace
tap "steipete/tap" # for codexbar

# Brews
brew "apktool"
brew "asitop"
brew "bash"
brew "borders"
brew "cadaver"
brew "cmake"
brew "go"
brew "hf"
brew "imagemagick"
brew "imagesnap"
brew "jadx"
brew "mole"
brew "pkgconf"
brew "shellcheck"
brew "sox"
brew "summarize"
brew "websocat"

# Casks
cask "aerospace"
cask "alfred"
cask "bitwarden"
cask "brave-browser"
cask "calibre"
cask "choosy"
cask "claude"
cask "claude-code"
cask "codex"
cask "codexbar"
cask "container"
cask "font-comic-mono"
cask "font-d2coding"
cask "ghostty"
cask "git-credential-manager"
cask "heynote"
cask "input-source-pro"
cask "itsycal"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "llamabarn"
cask "scroll-reverser"
cask "stats"
cask "ticktick"
cask "vibetunnel"
cask "zoom"
