# Usage:
#   brew bundle --file=~/path/to/Brewfile        # Install all
#   brew bundle check --file=~/path/to/Brewfile   # Check if satisfied
#   brew bundle cleanup --file=~/path/to/Brewfile # List not in Brewfile
#   brew bundle dump --force --file=Brewfile       # Regenerate from current

# Taps
tap "channprj/tap" # for kmsg
tap "FelixKratz/formulae" # for jankyborders
tap "nats-io/nats-tools" # for nats
tap "nikitabobko/tap" # for aerospace
tap "steipete/tap" # for codexbar

# Brews
brew "apktool"
brew "asitop"
brew "bash"
brew "bat"
brew "borders"
brew "btop"
brew "bun"
brew "cadaver"
brew "cmake"
brew "container"
brew "curl"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "golangci-lint"
brew "hf"
brew "htop"
brew "imagemagick"
brew "jq"
brew "kmsg"
brew "lazygit"
brew "mole"
brew "nats"
brew "neovim"
brew "node@24"
brew "pnpm"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree-sitter-cli"
brew "ty"
brew "uv"
brew "zellij"
brew "zoxide"

# Casks
cask "aerospace"
cask "alfred"
cask "bitwarden"
cask "brave-browser"
cask "calibre"
cask "choosy"
cask "claude"
cask "claude-code@latest"
cask "codex"
cask "codexbar"
cask "container"
cask "font-comic-mono"
cask "font-d2coding"
cask "ghostty"
cask "heynote"
cask "hop"
cask "input-source-pro"
cask "itsycal"
cask "thaw" # ice replacement
cask "karabiner-elements"
cask "scroll-reverser"
cask "stats"
cask "ticktick"
cask "zoom"
